bot_commands = [
    ('start', 'Це команда старт!'),
    ('design', 'Це команда дизайн'),
    ('registration', 'Це команда реєстрації'),
    ('delete_me', 'Це команда видалення'),
    ('feedback', 'Це команда фідбеку')
]

admin_id = 845597372
faculties = ["ФІТКІ", "ФІІТА", "ФЕЕЕМ", "ФМІБ", "ФБЦЕІ", "ФІЕС", "ФМТ", "ІДА"]
courses = ["1", "2", "3", "4", "1 маг."]
subgroups = ["1 Підгрупа", "2 Підгрупа"]
days = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця"]

no_group = {
    "not_here": "Немає моєї групи",
    "answer": "Пук пук"
}


start_phrases = {
    "choosing_fac": "Привіт, <b>{n}</b>!\nОберіть свій факультет зі списку:",
    "choosing_course": "Виберіть свій курс:",
    "choosing_group": "Виберіть Вашу групу:",
    "choose_subgroup": "Тепер виберіть підгрупу:\n\nЯкщо в вашій групі немає підгруп, то обирайте будь-яку.",
    "choosing_reg": "Виберіть день:",
    "choose_day": "Тепер виберіть день:",
    "wrong_faculty": "Я не знаю такого факультету\n\nБудь ласка, виберіть факультет з цього списку:",
    "wrong_course": "Я не знаю такого курсу\n\nБро, як взагалі можна ввести не той курс?",
    "wrong_group": "Я не знаю такої групи.\n\nБудь ласка, виберіть групу з цього списку:",
    "wrong_subgroup": "Я не знаю такої підгрупи.\n\nБудь ласка, виберіть підгрупу з цього списку:",
    "wrong_day": "Я не знаю такого дня.\n\nБудь ласка, виберіть день з цього списку:"
}

start_midlwr_phrases = {
    "first_visit": "Це твій перший запуск бота!"
}

design_phrases = {
    "just_it": "Достатньо обрати день тижня!"
}
design_midlwr_phrases = {
    "message_ans": "Ця функція доступна лише зареєстрованим користувачам!",
    "callback_ans": "Ця функція доступна лише зареєстрованим користувачам!"
}


reg_phrases = {
    "choose_faculty": "Реєcтруємось!\nОберіть свій факультет зі списку:",
    "choose_course": "Виберіть свій курс:",
    "choose_group": "Оберіть свою группу зі списку:",
    "choose_subgroup": "Тепер виберіть свою підгрупу:\n\nЯкщо в вашій групі немає підгруп, то обирайте будь-яку.",
    "incorrect_faculty": "Я не знаю такого факультету.\n\nБудь ласка, виберіть факультет з цього списку:",
    "incorrect_course": "Я не знаю такого курсу.\n\nБудь ласка, виберіть курс з цього списку:",
    "incorrect_group": "Я не знаю такої групи.\n\nБудь ласка, виберіть підгрупу з цього списку:",
    "incorrect_subgroup": "Я не знаю такої підгрупи.\n\nБудь ласка, виберіть підгрупу з цього списку:",
    "successful": "Вас зареєстровано!\nВаша група: <b>{g}</b>\nВаша підгрупа: <b>{s} Підгрупа</b>",
    "failed": "Упс... Щось пішло не так..."
}
reg_mdlwr_phrases = {
    "message_ans": "Ви вже зареєстровані!"
}

del_phrases = {
    "sucsessful": "Вас видалено з бази!",
    "unsucsessful": "Виникла помилка! Вас не видалено з бази!"
}

feedback_phrases = {
    "on_send": "Очікую повідомлення довжиною не більше 250 символів...\nЩоб нічого не відправляти напишіть /cancel",
    "sending_stop": "Нічого не відправляю...",
    "too_long": "Повідомлення занадто довге, не відправляю",
    "good": "Чудово, повідомлення відправлено!",
    "bad_stuff": "Виникла помилка. Будь ласка відправляйте лише текст!"
}
