bot_commands = [
    ('start', 'Це команда старт!'),
    ('design', 'Це команда дизайн'),
    ('profile', 'Це команда профілю'),
    ('registration', 'Це команда реєстрації'),
    ('delete_me', 'Це команда видалення'),
    ('feedback', 'Це команда фідбеку'),
    ('donate', 'Це команда донату'),
]

admin_id = 845597372
faculties = ["ФІТКІ", "ФІІТА", "ФЕЕЕМ", "ФМІБ", "ФБЦЕІ", "ФІЕС", "ФМТ", "ІДА"]
courses = ["1", "2", "3", "4", "1 маг.", "2 маг."]
subgroups = ["1 Підгрупа", "2 Підгрупа"]
days = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця"]
days_short = ["Пн", "Вт", "Ср", "Чт", "Пт"]
lesson_types = {
    "ЛК": "ЛК🟨",
    "ПЗ": "ПЗ🟩",
    "ЛР": "ЛР🟦"
}

daysLongNames = {
    "Пн": "Понеділок",
    "Вт": "Вівторок",
    "Ср": "Середа",
    "Чт": "Четвер",
    "Пт": "П'ятниця",
    "Сб": "Субота",
    "Нд": "Неділя"
}

teachersFullNames = {
    "Стахов О.Я.": "Стахов Олексій Ярославович",
    "Ткаченко О.М.": "Ткаченко Олександр Миколайович",
    "Клєопа І.А.": "Клєопа Ірина Анатоліївна",
    "Романюк О.Н.": "Романюк Олександр Никифорович",
    "Круподьорова Л.М.": "Круподьорова Людмила Михайлівна",
    "Прозор О.П.": "Прозор Олена Петрівна",
    "Кот С.О.": "Кот Сергій Олександрович",
    "Герасимов Т.Ю.": "Герасимов Тимофій Юрійович",
    "Тихонов В.К.": "Тихонов Володимир Костянтинович",
    "Кухарчук В.В.": "Кухарчук Василь Васильович",
    "Вишневська Н.С.": "Вишневська Ніна Серафимівна",
    "Чопляк В.В.": "Чопляк Вікторія Володимирівна",
    "Ковальчук І.В.": "Ковальчук Іван Васильович",
    "Мельник О.В.": "Мельник Олександр Васильович",
    "Сідлецька Т.І.": "Сідлецька Тетяна Іванівна",
    "Кухарчук Г.В.": "Кухарчук Галина Вікторівна"
}

start_end_lessons = {
    1: ["8:15", "9:00"],
    2: ["9:15", "10:00"],
    3: ["10:15", "11:00"],
    4: ["11:15", "12:00"],
    5: ["12:15", "13:00"],
    6: ["13:15", "14:00"],
    7: ["14:15", "15:00"],
    8: ["15:10", "15:55"],
    9: ["16:05", "16:50"],
    10: ["17:00", "17:45"],
    11: ["17:55", "18:40"],
    12: ["18:50", "19:35"],
    13: ["19:45", "20:25"],
    14: ["20:35", "21:15"]
}




no_group = {
    "not_here": "Немає моєї групи",
    "answer": "Пук пук"
}


start_phrases = {
    "choosing_fac": "Привіт, <b>{n}</b>!\nОберіть свій факультет зі списку:",
    "choosing_course": "Виберіть свій курс:",
    "choosing_group": "Виберіть Вашу групу:",
    "choose_subgroup": "Тепер виберіть підгрупу:\n\nЯкщо в вашій групі немає підгруп, то обирайте будь-яку.",
    "choosing_reg": "Виберіть день:",
    "choose_day": "Тепер виберіть день:",
    "wrong_faculty": "Я не знаю такого факультету\n\nБудь ласка, виберіть факультет з цього списку:",
    "wrong_course": "Я не знаю такого курсу\n\nБро, як взагалі можна ввести не той курс?",
    "wrong_group": "Я не знаю такої групи.\n\nБудь ласка, виберіть групу з цього списку:",
    "wrong_subgroup": "Я не знаю такої підгрупи.\n\nБудь ласка, виберіть підгрупу з цього списку:",
    "wrong_day": "Я не знаю такого дня.\n\nБудь ласка, виберіть день з цього списку:"
}

start_midlwr_phrases = {
    "first_visit": "Це твій перший запуск бота!"
}

design_phrases = {
    "just_it": "Достатньо обрати день тижня!"
}
design_midlwr_phrases = {
    "message_ans": "Ця функція доступна лише зареєстрованим користувачам!",
    "callback_ans": "Ця функція доступна лише зареєстрованим користувачам!"
}


reg_phrases = {
    "choose_faculty": "Реєструємось!\nОберіть свій факультет зі списку:",
    "choose_course": "Виберіть свій курс:",
    "choose_group": "Оберіть свою группу зі списку:",
    "choose_subgroup": "Тепер виберіть свою підгрупу:\n\nЯкщо в вашій групі немає підгруп, то обирайте будь-яку.",
    "incorrect_faculty": "Я не знаю такого факультету.\n\nБудь ласка, виберіть факультет з цього списку:",
    "incorrect_course": "Я не знаю такого курсу.\n\nБудь ласка, виберіть курс з цього списку:",
    "incorrect_group": "Я не знаю такої групи.\n\nБудь ласка, виберіть підгрупу з цього списку:\n\n",
    "incorrect_subgroup": "Я не знаю такої підгрупи.\n\nБудь ласка, виберіть підгрупу з цього списку:\n\n"
                          "Якщо в вашій групі немає підгруп, то оберіть будь-яку",
    "successful": "Вас зареєстровано!\nВаш факультет: <b>{f}</b>\n"
                  "Ваш курс: <b>{c}</b>\nВаша група: <b>{g}</b>\nВаша підгрупа: <b>{s} Підгрупа</b>",
    "failed": "Упс... Щось пішло не так..."
}
reg_mdlwr_phrases = {
    "message_ans": "Ви вже зареєстровані!\n\nВаша група: <b>{g}</b>\nВаша підгрупа: <b>{s}</b>"
}

del_phrases = {
    "sucsessful": "Вас видалено з бази!",
    "unsucsessful": "Виникла помилка! Вас не видалено з бази!"
}

feedback_phrases = {
    "on_send": "Очікую повідомлення довжиною не більше 250 символів...\nЩоб нічого не відправляти напишіть /cancel",
    "sending_stop": "Нічого не відправляю...",
    "too_long": "Повідомлення занадто довге, не відправляю",
    "good": "Чудово, повідомлення відправлено!",
    "bad_stuff": "Виникла помилка. Будь ласка відправляйте лише текст!"
}

donate_phrases = {
    "thanks": "Дякую за те, що вирішили підтримати бота!",
    "jar": "Посилання на банку",
    "link": "google.com"
}

scheduled_reminder_phrases = {
    "reminder": "Через 5 хвилин почнеться урок:\n<b>{n}</b>\n\nПосилання:\n{l}"
}

profile_phrases = {
    "profile": "Ваш профіль користувача\n\nВаша група:{g}\nВаша підгрупа:{s}",
    "on": "🟥Нагадування про урок",
    "off": "🟩Нагадування про урок",
    "on_answ": "Ви підписались на розсилку!",
    "off_answ": "Ви відписались від розсилки!",
    "error": "Виникла помилка!"
}