bot_commands = [
    ('start', 'Отримати розклад📆'),
    ('design', 'Зручне меню розкладу💅'),
    ('profile', 'Профіль користувача👤'),
    ('registration', 'Зареєструватися в боті✍️'),
    ('delete_me', 'Видалити себе з бази бота🕊'),
    ('feedback', 'Відправити фідбек розробнику🗣'),
    ('donate', 'Підтримати бота🤗'),
]

admin_id = 845597372
faculties = ["ФІТКІ", "ФІІТА", "ФЕЕЕМ", "ФМІБ", "ФБЦЕІ", "ФІЕС", "ФМТ", "ІДА"]
courses = ["1", "2", "3", "4", "1 маг.", "2 маг."]
subgroups = ["1 Підгрупа", "2 Підгрупа"]
days = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця"]
days_short = ["Пн", "Вт", "Ср", "Чт", "Пт"]
lesson_types = {
    "ЛК": "ЛК🟨",
    "ПЗ": "ПЗ🟩",
    "ЛР": "ЛР🟦"
}

daysLongNames = {
    "Пн": "Понеділок",
    "Вт": "Вівторок",
    "Ср": "Середа",
    "Чт": "Четвер",
    "Пт": "П'ятниця",
    "Сб": "Субота",
    "Нд": "Неділя"
}

teachersFullNames = {
    "Стахов О.Я.": "Стахов Олексій Ярославович",
    "Ткаченко О.М.": "Ткаченко Олександр Миколайович",
    "Клєопа І.А.": "Клєопа Ірина Анатоліївна",
    "Романюк О.Н.": "Романюк Олександр Никифорович",
    "Круподьорова Л.М.": "Круподьорова Людмила Михайлівна",
    "Прозор О.П.": "Прозор Олена Петрівна",
    "Кот С.О.": "Кот Сергій Олександрович",
    "Герасимов Т.Ю.": "Герасимов Тимофій Юрійович",
    "Тихонов В.К.": "Тихонов Володимир Костянтинович",
    "Кухарчук В.В.": "Кухарчук Василь Васильович",
    "Вишневська Н.С.": "Вишневська Ніна Серафимівна",
    "Чопляк В.В.": "Чопляк Вікторія Володимирівна",
    "Ковальчук І.В.": "Ковальчук Іван Васильович",
    "Мельник О.В.": "Мельник Олександр Васильович",
    "Сідлецька Т.І.": "Сідлецька Тетяна Іванівна",
    "Кухарчук Г.В.": "Кухарчук Галина Вікторівна"
}

start_end_lessons = {
    1: ["8:15", "9:00"],
    2: ["9:15", "10:00"],
    3: ["10:15", "11:00"],
    4: ["11:15", "12:00"],
    5: ["12:15", "13:00"],
    6: ["13:15", "14:00"],
    7: ["14:15", "15:00"],
    8: ["15:10", "15:55"],
    9: ["16:05", "16:50"],
    10: ["17:00", "17:45"],
    11: ["17:55", "18:40"],
    12: ["18:50", "19:35"],
    13: ["19:45", "20:25"],
    14: ["20:35", "21:15"]
}


no_group = {
    "not_here": "Немає моєї групи",
    "answer": "На жаль наразі бот не підтримує усі групи університету😢\n\n"
              "❗Але за благодійний внесок у розмірі від 25 гривень"
              " ваша група буде додана позачергово💪\nУсі кошти підуть на підтримку бота🤖\n\n"
              "Щоб отримати більше інформації напишіть команду <i>/donate</i>"
}


start_phrases = {
    "choosing_fac": "Привіт, <b>{n}</b>!\nОберіть свій факультет зі списку:",
    "choosing_course": "Виберіть свій курс:",
    "choosing_group": "Виберіть Вашу групу:",
    "choose_subgroup": "Тепер виберіть підгрупу:\n\n️️️☝️Якщо в вашій групі немає підгруп, то обирайте будь-яку.",
    "choose_day": "Тепер виберіть день:",
    "choosing_reg": "Виберіть день:",
    "wrong_faculty": "Я не знаю такого факультету\n\nБудь ласка, виберіть факультет з цього списку:",
    "wrong_course": "Я не знаю такого курсу\n\nБро, як взагалі можна ввести не той курс?",
    "wrong_group": "Я не знаю такої групи.\n\nБудь ласка, виберіть групу з цього списку:",
    "wrong_subgroup": "Я не знаю такої підгрупи.\n\nБудь ласка, виберіть підгрупу з цього списку:",
    "wrong_day": "Я не знаю такого дня.\n\nБудь ласка, виберіть день з цього списку:"
}

start_midlwr_phrases = {
    "first_visit": "Вітаю, <b>{n}</b>!\nВиглядає на те, що це перший запуск бота👀\n"
                   "Щоб користуватись ботом скористайтеся меню, або просто напишіть «/» щоб побачити"
                   " доступні функції. Готовий допомогти Вам!💬"
}

design_phrases = {
    "just_it": "Достатньо обрати день тижня!"
}
design_midlwr_phrases = {
    "message_ans": "Ця функція доступна лише зареєстрованим користувачам!"
                   " Щоб зареєструватись напишіть команду <i>/registration</i>",
    "callback_ans": "Ця функція доступна лише зареєстрованим користувачам!"
}


reg_phrases = {
    "choose_faculty": "Реєструємось!✍️\nОберіть свій факультет зі списку:",
    "choose_course": "Виберіть свій курс:",
    "choose_group": "Оберіть свою группу зі списку:",
    "choose_subgroup": "Тепер виберіть свою підгрупу:\n\n☝️Якщо в вашій групі немає підгруп, то обирайте будь-яку.",
    "incorrect_faculty": "Я не знаю такого факультету.\n\nБудь ласка, виберіть факультет з цього списку:",
    "incorrect_course": "Я не знаю такого курсу.\n\nБудь ласка, виберіть курс з цього списку:",
    "incorrect_group": "Я не знаю такої групи.\n\nБудь ласка, виберіть групу з цього списку:",
    "incorrect_subgroup": "Я не знаю такої підгрупи.\n\nБудь ласка, виберіть підгрупу з цього списку:\n\n"
                          "Якщо в вашій групі немає підгруп, то оберіть будь-яку",
    "successful": "Вас зареєстровано!🎉\n\n > 🏛️Ваш факультет: <b>{f}</b>\n"
                  " > 📚Ваш курс: <b>{c} Курс</b>\n > 🏫Ваша група: <b>{g}</b>\n"
                  " > 👥Ваша підгрупа: <b>{s} Підгрупа</b>\n\n"
                  "Тепер вам доступне меню розкладу при команді <i>/design</i>💅 та нагадування про початок уроку"
                  " у <i>/profile</i>👤\n\n"
                  "Якщо ви бажаєте змінити цю інформацію то напишіть команду <i>/delete_me</i>"
                  " та зареєструйтесь наново🔁",
    "failed": "Упс... Щось пішло не так..."
}
reg_mdlwr_phrases = {
    "message_ans": "Ви вже зареєстровані!✅\n\n > 🏫Ваша група: <b>{g}</b>\n > 👥Ваша підгрупа: <b>{s} Підгрупа</b>\n\n"
                   "Якщо ви бажаєте змінити цю інформацію то напишіть команду <i>/delete_me</i>"
                   " та зареєструйтесь наново🔁"
}

del_phrases = {
    "sucsessful": "Вас видалено з бази!🕊",
    "unsucsessful": "Виникла помилка! Вас не видалено з бази."
}

feedback_phrases = {
    "on_send": "Очікую повідомлення довжиною не більше 250 символів...\n"
               "Щоб нічого не відправляти напишіть <i>/cancel</i>",
    "sending_stop": "Нічого не відправляю❌",
    "too_long": "Повідомлення занадто довге, не відправляю❌",
    "good": "Чудово, повідомлення відправлено!📩",
    "bad_stuff": "Виникла помилка. Будь ласка відправляйте лише текст!"
}

donate_phrases = {
    "thanks": "Дякую за те, що вирішили підтримати бота!💗\n\nВін працює безкоштовно для всіх,"
              " але потребує коштів для роботи💸\n"
              "Коштами з цієї банки буде оплачуватись сервер для бота🤖\n\n"
              "🍇 Якщо ви бажаєте додати свою чи будь-яку іншу групу у бота,"
              " то поповніть банку на сумму <u>більшу за 25 гривень</u>"
              " та вкажіть у коментарі назву групи яку хочете додати, наприклад: <i>6ПІ-23б</i>,"
              " і я додам її найближчим часом\n\n"
              "Номер банки: <code>5375 4112 1022 1946</code>\n(Клікабельно)",
    "jar": "Monobank🐈‍⬛‍",
    "link": "https://send.monobank.ua/jar/6dmedmqKyN"
}

scheduled_reminder_phrases = {
    "reminder": "⏰Через 5 хвилин почнеться урок:\n<b>{n}, {type}</b>\nВикладач: <b>{teacher}</b>\n\nПосилання🔗:\n{l}"
}

profile_phrases = {
    "profile": "Ваш профіль користувача👤\n\n > 🏫Ваша група: <b>{g}</b>\n > 👥Ваша підгрупа: <b>{s} Підгрупа</b>",
    "on": "🟥Нагадування на урок",
    "off": "🟩Нагадування на урок",
    "on_answ": "Ви підписались на розсилку!",
    "off_answ": "Ви відписались від розсилки!",
    "error": "Виникла помилка!",
    "first_photo": "AgACAgIAAxkBAAIYjmVTxfM7P7p0XA3dAt65hXacilEsAAJq1TEbUaehSsgSj4fPILVGAQADAgADeAADMwQ",
    "second_photo": "AgACAgIAAxkBAAIYlGVTxfywGjK6sjsV-TIokbGKVraSAAJr1TEbUaehSpu6riQXFh5UAQADAgADeAADMwQ",
    "on_check": "❗ Підписавшись на розсилку, одразу із нагадуванням,"
                " ви матимете змогу отримати також посилання на лекцію.\n\n"
                "🔐 Для забезпечення конфіденційності посилань я маю перевірити чи є ви в системі JetIQ\n\n"
                "📨 Для цього вам достатньо надіслати ваш цифровий логін."
                " Де його можна взяти показано на скріншотах.\n\n"
                "Будь ласка, відправте ваш перший логін, який ви отримали при реєстрації у JetIQ, або код вашої"
                " студентської пошти ________.stud@vntu.vn.ua (це одне й те саме).",
    "begin_check": "Надіслати логін✅",
    "cancel_check": "Відмовитись від розсилки❌",
    "begin_wait": "Очікую на логін...",
    "cancel_ok": "Перевірка зупинена⛔️",
    "check_ok": "Все чудово, тепер ви підписані на розсилку!💫\n"
                "Якщо забажаєте вимкнути, зробити ви це зможете у команді <i>/profile</i>",
    "check_failed": "На жаль я не зміг знайти вас в системі JetIQ😢\n"
                    "Якщо ви впевнені що це помилка, будь ласка, повідомте про це адміністратора.",
    "cookies_fail": "Виникла помилка😵‍💫\nАдміністратор вже повідомлений. Спробуйте будь ласка пізніше."
}

links_phrases = {
    "waiting_lesson_name": "Очікую назву предмету.\nВона має бути <u>ідентичною</u> як в jetiq або в боті.",
    "wrong_lesson": "Такого предмету в базі немає. Перевірте будь ласка правильність написання та надішліть ще раз",
    "waiting_lesson_type": "Тепер надішліть тип уроку\n(ЛК, ПЗ, ЛР)",
    "wrong_type": "Я не знаю такого типу. Будь ласка надішліть тип уроку знову (ЛК, ПЗ, ЛР)\n\n"
                  "Якщо в jetiq саме так, будь ласка, дайте мені знати",
    "waiting_teachers_name": "Тепер надішліть прізвище та ініціали викладача.\n\nНаприклад:\n\n"
                             "Кабачій В.В.\nСтахов О.Я.\nКруподьорова Л.М.",
    "no_dot": "Крапка у кінці обов'язкова. Відправте будь ласка ще раз.\n\n"
              "Якщо в jetiq саме так, будь ласка, дайте мені знати",
    "wrong_teacher": "Такого викладача немає в базі. Будь ласка, перевірте правильність написання фамілії та ініціалів",
    "waiting_link": "Тепер надішліть посилання",
    "added_link": "Тепер предмет: {n}, {type}\n"
                  "Викладача: {teacher}\nМає посилання: {l}\n\n"
                  "Список усіх доступних посилань: <i>/links</i>",
    "link_only": "Я очікую посилання!",
    "delete_name": "Надішліть мені назву предмету який бажаєте видалити",
    "delete_teacher_name": "Тепер надішліть прізвище та ініціали викладача.",
    "deleted": "Видалив посилання для предмету: {n}, {type}\n"
               "Викладача: {teacher}\n\nБудь ласка перевірте це командою <i>/links</i>!",
    "all_links": "Усі уроки з посиланнями:\n\nЩоб видалити пропишіть команду /delete_link,"
                 " а потім <b>таку ж</b> інформацію як в повідомленні.\n"
                 "Щоб додати посилання: <i>/set_link</i>",
    "link_temp": "Назва: {n}\n\nТип: {type}\n\nВикладач: {teacher}\n\n"
                 "Посилання: {l}",
    "no_links": "Уроків з посиланням немає"
}
