groups_ids = {

    # FBCEI
    "1Б-23б": "10845",
    "АДВ-23б": "10849",


    # FEEM
    "ЕЕ-23б": "10796",
    "ЕС-23б": "10800",

    # FIES
    "КІВТ-23б": "10770",


    # FIITA
    "1КН-23б": "10779",
    "2КН-23б": "10781",
    "3КН-23б": "10782",
    "4КН-23б": "10783",
    "1АКІТР-23б": "10804",
    "1ІСТ-22б": "8720",

    # FITKI
    "1ПІ-23б": "10679",
    "2ПІ-23б": "10680",
    "3ПІ-23б": "10681",
    "4ПІ-23б": "10682",
    "5ПІ-23б": "10839",
    "6ПІ-23б": "10840",
    "1БС-23б": "10686",
    "2БС-23б": "10842",
    "1КІ-23б": "10683",

    # FMT
    "1АТ-23б": "10755",
    "2АТ-23б": "10793",

    # FMIB
    "1КІТС-23б": "10817"


}  # Тут будуть всі доступні групи. Без сортування

# IF YOU'RE ADDING GROUP TO groups_ids ADD IT TO groups_list TOO !!!!!!!

groups_list = {
    # FITKI
    ("ФІТКІ", "1"): ["1ПІ-23б", "2ПІ-23б", "3ПІ-23б", "4ПІ-23б", "5ПІ-23б", "6ПІ-23б",
                     "1КІ-23б", "1БС-23б", "2БС-23б"],
    ("ФІТКІ", "2"): [],
    ("ФІТКІ", "3"): [],
    ("ФІТКІ", "4"): [],
    ("ФІТКІ", "1 маг."): [],
    ("ФІТКІ", "2 маг."): [],

    # FIITA
    ("ФІІТА", "1"): ["1КН-23б", "2КН-23б", "3КН-23б", "4КН-23б", "1АКІТР-23б"],
    ("ФІІТА", "2"): ["1ІСТ-22б"],
    ("ФІІТА", "3"): [],
    ("ФІІТА", "4"): [],
    ("ФІІТА", "1 маг."): [],
    ("ФІІТА", "2 маг."): [],

    # FEEM
    ("ФЕЕЕМ", "1"): ["ЕЕ-23б", "ЕС-23б"],
    ("ФЕЕЕМ", "2"): [],
    ("ФЕЕЕМ", "3"): [],
    ("ФЕЕЕМ", "4"): [],
    ("ФЕЕЕМ", "1 маг."): [],
    ("ФЕЕЕМ", "2 маг."): [],

    # FMІB
    ("ФМІБ", "1"): ["1КІТС-23б"],
    ("ФМІБ", "2"): [],
    ("ФМІБ", "3"): [],
    ("ФМІБ", "4"): [],
    ("ФМІБ", "1 маг."): [],
    ("ФМІБ", "2 маг."): [],

    # FBCEI
    ("ФБЦЕІ", "1"): ["1Б-23б", "АДВ-23б"],
    ("ФБЦЕІ", "2"): [],
    ("ФБЦЕІ", "3"): [],
    ("ФБЦЕІ", "4"): [],
    ("ФБЦЕІ", "1 маг."): [],
    ("ФБЦЕІ", "2 маг."): [],

    # FIES
    ("ФІЕС", "1"): ["КІВТ-23б"],
    ("ФІЕС", "2"): [],
    ("ФІЕС", "3"): [],
    ("ФІЕС", "4"): [],
    ("ФІЕС", "1 маг."): [],
    ("ФІЕС", "2 маг."): [],

    # FMT
    ("ФМТ", "1"): ["1АТ-23б", "2АТ-23б"],
    ("ФМТ", "2"): [],
    ("ФМТ", "3"): [],
    ("ФМТ", "4"): [],
    ("ФМТ", "1 маг."): [],
    ("ФМТ", "2 маг."): [],

    # IDA
    ("ІДА", "1"): [],
    ("ІДА", "2"): [],
    ("ІДА", "3"): [],
    ("ІДА", "4"): [],
    ("ІДА", "1 маг."): [],
    ("ІДА", "2 маг."): []
}
