groups_ids = {
    "1ПІ-23б": "10679",
    "2ПІ-23б": "10680",
    "3ПІ-23б": "10681",
    "4ПІ-23б": "10682",
    "5ПІ-23б": "10839",
    "6ПІ-23б": "10840",
    "1ІСТ-22б": "8720",
    "КІВТ-23б": "10770"
}  # Тут будуть всі доступні групи. Без сортування

# IF YOU'RE ADDING GROUP TO groups_ids ADD IT TO groups_list TOO !!!!!!!

groups_list = {
    # FITKI
    ("ФІТКІ", "1"): ["1ПІ-23б", "2ПІ-23б", "3ПІ-23б", "4ПІ-23б", "5ПІ-23б", "6ПІ-23б"],
    ("ФІТКІ", "2"): [],
    ("ФІТКІ", "3"): [],
    ("ФІТКІ", "4"): [],
    ("ФІТКІ", "1 маг."): [],

    # FIITA
    ("ФІІТА", "1"): [],
    ("ФІІТА", "2"): ["1ІСТ-22б"],
    ("ФІІТА", "3"): [],
    ("ФІІТА", "4"): [],
    ("ФІІТА", "1 маг."): [],

    # FEEM
    ("ФЕЕЕМ", "1"): [],
    ("ФЕЕЕМ", "2"): [],
    ("ФЕЕЕМ", "3"): [],
    ("ФЕЕЕМ", "4"): [],
    ("ФЕЕЕМ", "1 маг."): [],

    # FMІB
    ("ФМІБ", "1"): [],
    ("ФМІБ", "2"): [],
    ("ФМІБ", "3"): [],
    ("ФМІБ", "4"): [],
    ("ФМІБ", "1 маг."): [],

    # FBCEI
    ("ФБЦЕІ", "1"): [],
    ("ФБЦЕІ", "2"): [],
    ("ФБЦЕІ", "3"): [],
    ("ФБЦЕІ", "4"): [],
    ("ФБЦЕІ", "1 маг."): [],

    # FIES
    ("ФІЕС", "1"): ["КІВТ-23б"],
    ("ФІЕС", "2"): [],
    ("ФІЕС", "3"): [],
    ("ФІЕС", "4"): [],
    ("ФІЕС", "1 маг."): [],

    # FMT
    ("ФМТ", "1"): [],
    ("ФМТ", "2"): [],
    ("ФМТ", "3"): [],
    ("ФМТ", "4"): [],
    ("ФМТ", "1 маг."): [],

    # IDA
    ("ІДА", "1"): [],
    ("ІДА", "2"): [],
    ("ІДА", "3"): [],
    ("ІДА", "4"): [],
    ("ІДА", "1 маг."): []
}
